#include <iostream>

using namespace std;

int main()
{
    setlocale (LC_CTYPE, "ukr");
    double weight,height, age, BMR, TDEE, deficitCalories, BMI;

    cout << "==========>> !Введіть інформацію!  <<==========" << endl;

    cout << "Введіть вашу вагу в кілограмах  :   ";
    cin >> weight;

    cout << "Введіть ваш ріст в сантиметрах  :   ";
    cin >> height;

    cout << "Введіть ваш вік  :  ";
    cin >> age;
    
    cout << "================================================"<<endl;

    // Обчислюємо базовий метаболізм (BMR) за формулою Харріса-Бенедикта для чоловіків
    
    BMR = 88.362 + (13.397 * weight) + (4.799 * height) - (5.677 * age);
    
    // Рівень активності беремо середній
    TDEE = BMR * 1.55;


    // Припустимо, що ви хочете скинути вагу та зменшити денну норму калорій на 500 ккал.
    deficitCalories = TDEE - 500;
    
      // Обчислюємо індекс маси тіла
    BMI = weight / ((height / 100) * (height / 100));

cout << "" << endl;
cout << "==========>> Інформація про тіло <<=========="<< endl;
cout << "Ваш вік  :  " << age  << " років" << endl;
cout << "Ваша вага  :  " << weight <<" кг" << endl;
cout << "Ваш ріст  :  " << height <<" см" << endl;
cout << "Для створення дефіцита калорій в 500 ккал ваша дневна норма калорій повина бути  :  " <<deficitCalories << "ккал" << endl;
cout << "Ваш індекс маси тіла(ІМТ) складає  : " << BMI << endl;
cout << "=============================================" << endl;


    return 0;
}